app/controllers/upload_csvs_controller.rb

SELECT  "upload_csvs".* FROM "upload_csvs" ORDER BY "upload_csvs"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @upload_csvs = UploadCsv.all

INSERT INTO "upload_csvs" ("users", "csv_file", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["users", "[\"saddasds@sample.com\"]"], ["csv_file", "sample_csv.csv"], ["created_at", "2020-08-21 13:56:58.096294"], ["updated_at", "2020-08-21 13:56:58.096294"]]
---
  def create
    @upload_csv = UploadCsv.new(upload_csv_params)
    respond_to do |format|
      if @upload_csv.save

UPDATE "upload_csvs" SET "csv_file" = $1, "users" = $2, "updated_at" = $3 WHERE "upload_csvs"."id" = $4  [["csv_file", "sample_test.csv"], ["users", "[\"dsaads@sample.com\"]"], ["updated_at", "2020-08-21 18:59:49.392903"], ["id", 27]]
---
  def update
    respond_to do |format|
      if @upload_csv.update(upload_csv_params)

DELETE FROM "upload_csvs" WHERE "upload_csvs"."id" = $1  [["id", 4]]
---
  def destroy
    @upload_csv.destroy

SELECT  "upload_csvs".* FROM "upload_csvs" WHERE "upload_csvs"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
    def set_upload_csv
      @upload_csv = UploadCsv.find(params[:id])