app/controllers/upload_csvs_controller.rb

  def index
        GenrateCsvJob.perform_later(UploadCsv.last)

    @pagy, @upload_csvs = pagy(UploadCsv.all, page: params[:page], items: 5)
---
SELECT  "upload_csvs".* FROM "upload_csvs" ORDER BY "upload_csvs"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "upload_csvs"

  def update
    respond_to do |format|
      if @upload_csv.update(upload_csv_params)
---
UPDATE "upload_csvs" SET "generated_csv" = $1, "updated_at" = $2 WHERE "upload_csvs"."id" = $3  [["generated_csv", "#<File:0x00007efe56f7d450>"], ["updated_at", "2020-08-21 13:17:29.442920"], ["id", 8]]

  def destroy
    @upload_csv.destroy
---
DELETE FROM "upload_csvs" WHERE "upload_csvs"."id" = $1  [["id", 28]]

  def set_upload_csv
    @upload_csv = UploadCsv.find(params[:id])
---
SELECT  "upload_csvs".* FROM "upload_csvs" WHERE "upload_csvs"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]