app/jobs/genrate_csv_job.rb

  def perform(upload_csv)
    processed_csv(upload_csv)
    file = Tempfile.open(["#{Rails.root}/public/generated_csv", ".csv"]) do |csv|
      csv << ["referal_link", "home_link", "count"]
      @new_array.each do |new_array|
        csv << new_array
      end
      file = "#{Rails.root}/public/product_data.csv"
      headers = ["referal link", "home_link", "count"]
      file = CSV.open(file, 'w', write_headers: true, headers: headers) do |writer|
        @new_array.each do |new_array|
          writer << new_array
        end
        upload_csv.update(:generated_csv => file)
---
UPDATE "upload_csvs" SET "generated_csv" = $1, "updated_at" = $2 WHERE "upload_csvs"."id" = $3  [["generated_csv", "/home/akash/Ajay/ShahnawazTestSO/public/product_data.csv"], ["updated_at", "2020-08-21 18:37:55.298328"], ["id", 26]]